firewall-webapps-bgs/frontend/controllers/TaskController.php

INSERT INTO `task` (`url`, `jumlah`, `status`, `user_id`, `facebook`, `twitter`, `create_time`) VALUES ('data_praktikan/Putih_20/task_Putih_20_1445390600', 42, 'Pending', 20, 'No', 'No', '1445390600')
---
                if(is_dir($dir) === false){
                    mkdir($dir);
                }
                $file_to_write = 'task_'.$mode->username.'_'.$model->user_id.'_'.$model->create_time;