firewall-webapps-bgs/backend/controllers/TaskController.php

SELECT * FROM `task` WHERE `task_id`='26'
---
    protected function findModel($id)
    {
        if(($role = priviledge::getRole()) == 'Admin'){
            if (($model = Task::findOne($id)) !== null) {