firewall-webapps-bgs/backend/controllers/UserController.php

SELECT * FROM `user` WHERE `id`='18'
---
    protected function findModel($id)
    {
        if(($role = priviledge::getRole()) == 'Admin'){
            if (($model = User::findOne($id)) !== null) {